БИТУправление_медицинским_центром_демо/src/Documents/ПравилаРаспределенияЗатрат/ПравилаРаспределенияЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПравилаРаспределенияЗатрат</name>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяСтатьяЗатратОтраженияЗарплаты</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РаспределениеЗатратФилиаловНаСпециализации</name>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Филиал</name>
      <type>
        <types>CatalogRef.Филиалы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПравилоРаспределения</name>
      <type>
        <types>CatalogRef.ПравилаРаспределенияЗатрат</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РаспределениеЗатратСпециализацийНаНоменклатуру</name>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Специализация</name>
      <type>
        <types>CatalogRef.КатегорииВыработки</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособРаспределения</name>
      <type>
        <types>EnumRef.СпособРаспределенияЗатрат</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/Enums/СпособРаспределенияЗатрат/СпособРаспределенияЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособРаспределенияЗатрат</name>
  <enumValues>
    <name>ПоФиксированнойБазе</name>
  </enumValues>
  <enumValues>
    <name>ПоСуммеПродаж</name>
  </enumValues>
  <enumValues>
    <name>ПоКоличествуУслуг</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Documents/ПравилаРаспределенияЗатрат/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Если в базе есть только одно правило распределения затрат, то возвращает его, иначе пустую ссылку.
//
// Возвращаемое значение:
//	СправочникСсылка.ПравилаРаспределенияЗатрат.
//
Функция ПравилоРаспределенияЗатратНаСпециализацииПоУмолчанию() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
					|	ПравилаРаспределенияЗатрат.Ссылка КАК Правило
					|ИЗ
					|	Справочник.ПравилаРаспределенияЗатрат КАК ПравилаРаспределенияЗатрат
					|ГДЕ
					|	НЕ ПравилаРаспределенияЗатрат.ПометкаУдаления";
	тзПравила = Запрос.Выполнить().Выгрузить();
	Если тзПравила.Количество() = 1 Тогда
		Возврат тзПравила[0].Правило; 		
	КонецЕсли;
	
	Возврат Справочники.ПравилаРаспределенияЗатрат.ПустаяСсылка(); 		
	
КонецФункции 

// Процедура ЗаполнитьНовыйДокументПоУмолчанию.
//
// Параметры:
//  ДокументОбъект - ДокументСсылка.ПравилаРаспределенияЗатрат - заполняемый документ.
//
Процедура ЗаполнитьНовыйДокументПоУмолчанию(ДокументОбъект) Экспорт
	
	Если Ложь Тогда ДокументОбъект = Документы.ПравилаРаспределенияЗатрат.СоздатьДокумент() КонецЕсли;
	
	Если ДокументОбъект.Ссылка.Пустая()
		И ДокументОбъект.РаспределениеЗатратФилиаловНаСпециализации.Количество() = 0
		И ДокументОбъект.РаспределениеЗатратСпециализацийНаНоменклатуру.Количество() = 0
	Тогда
		НоваяСтрока = ДокументОбъект.РаспределениеЗатратФилиаловНаСпециализации.Добавить();
		НоваяСтрока.ПравилоРаспределения = ПравилоРаспределенияЗатратНаСпециализацииПоУмолчанию();
		
		НоваяСтрока = ДокументОбъект.РаспределениеЗатратСпециализацийНаНоменклатуру.Добавить();
		НоваяСтрока.СпособРаспределения = Перечисления.СпособРаспределенияЗатрат.ПоСуммеПродаж;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокументОбъект.ОсновнаяСтатьяЗатратОтраженияЗарплаты) Тогда
		ДокументОбъект.ОсновнаяСтатьяЗатратОтраженияЗарплаты = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ОсновнаяСтатьяЗатратЗарплаты");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
